import unittest
import random
import os

import main


class BastShoeTest(unittest.TestCase):

    def tearDown(self):
        os.remove(main.history_filename)
        os.remove(main.pointer_filename)

    def test_case1(self):
        data = [
            ['1 Привет', 'Привет'],
            ['1 , Мир!', 'Привет, Мир!'],
            ['1 ++', 'Привет, Мир!++'],
            ['2 2', 'Привет, Мир!'],
            ['4', 'Привет, Мир!++'],
            ['4', 'Привет, Мир!'],
            ['1 *', 'Привет, Мир!*'],
            ['4', 'Привет, Мир!'],
            ['4', 'Привет, Мир!'],
            ['4', 'Привет, Мир!'],
            ['3 6', ','],
            ['2 100', ''],
            ['1 Привет', 'Привет'],
            ['1 , Мир!', 'Привет, Мир!'],
            ['1 ++', 'Привет, Мир!++'],
            ['4', 'Привет, Мир!'],
            ['4', 'Привет'],
            ['5', 'Привет, Мир!'],
            ['4', 'Привет'],
            ['5', 'Привет, Мир!'],
            ['5', 'Привет, Мир!++'],
            ['5', 'Привет, Мир!++'],
            ['5', 'Привет, Мир!++'],
            ['4', 'Привет, Мир!'],
            ['4', 'Привет'],
            ['2 2', 'Прив'],
            ['4', 'Привет'],
            ['5', 'Прив'],
            ['5', 'Прив'],
            ['5', 'Прив'],
        ]

        for i in range(len(data)):
            dataset = data[i]
            self.assertEqual(main.BastShoe(dataset[0]), dataset[1], msg=f'{i+1} line')

    def test_case2(self):
        data = [
            ['1 Зарядка', 'Зарядка'],
            ['1  для ума', 'Зарядка для ума'],
            ['2 4', 'Зарядка для'],
            ['1  меня', 'Зарядка для меня'],
            ['4', 'Зарядка для'],
            ['4', 'Зарядка для ума'],
            ['3 3', 'я'],
            ['1  молодец', 'я молодец'],
            ['2 8', 'я'],
            ['5', 'я'],
            ['4', 'я молодец'],
        ]

        for i in range(len(data)):
            dataset = data[i]
            self.assertEqual(main.BastShoe(dataset[0]), dataset[1], msg=f'{i+1} line')

    def test_case3(self):
        data = [
            ['1 Мастер', 'Мастер'],
            ['1  И Маргарита', 'Мастер И Маргарита'],
            ['1 ?!', 'Мастер И Маргарита?!'],
            ['2 5', 'Мастер И Маргар'],
            ['4', 'Мастер И Маргарита?!'],
            ['4', 'Мастер И Маргарита'],
            ['5', 'Мастер И Маргарита?!'],
            ['5', 'Мастер И Маргар'],
            ['5', 'Мастер И Маргар'],
            ['2 2', 'Мастер И Марг'],
            ['3 11', 'р'],
            ['1 оман.', 'роман.'],
            ['2 10', ''],
            ['1 классика', 'классика'],
            ['3 15', ''],
        ]

        for i in range(len(data)):
            dataset = data[i]
            self.assertEqual(main.BastShoe(dataset[0]), dataset[1], msg=f'{i+1} line')

    def test_case4(self):
        data = [
            ['1 Зарядка', 'Зарядка'],
            ['1  для ума', 'Зарядка для ума'],
            ['2 4', 'Зарядка для'],
            ['1  меня', 'Зарядка для меня'],
            ['4', 'Зарядка для'],
            ['4', 'Зарядка для ума'],
            ['3 3', 'я'],
            ['4', 'Зарядка'],
            ['7 (некорректная команда)', 'Зарядка'],
            ['1 !', 'Зарядка!'],
        ]

        for i in range(len(data)):
            dataset = data[i]
            self.assertEqual(main.BastShoe(dataset[0]), dataset[1], msg=f'{i+1} line')

if __name__ == '__main__':
    unittest.main()
